#include "ekf.h"
#include "math.h"
#include "foc.h"
#include "parameters.h"

const float sin_tab[] = {
    0, 0.012296f, 0.024589f, 0.036879f, 0.049164f, 0.061441f, 0.073708f, 0.085965f, 0.098208f, 0.11044f, 0.12265f,
    0.13484f, 0.14702f, 0.15917f, 0.17129f, 0.18339f, 0.19547f, 0.20751f, 0.21952f, 0.2315f, 0.24345f, 0.25535f,
    0.26722f, 0.27905f, 0.29084f, 0.30258f, 0.31427f, 0.32592f, 0.33752f, 0.34907f, 0.36057f, 0.37201f, 0.38339f,
    0.39472f, 0.40599f, 0.41719f, 0.42834f, 0.43941f, 0.45043f, 0.46137f, 0.47224f, 0.48305f, 0.49378f, 0.50443f,
    0.51501f, 0.52551f, 0.53593f, 0.54627f, 0.55653f, 0.5667f, 0.57679f, 0.58679f, 0.5967f, 0.60652f, 0.61625f,
    0.62589f, 0.63543f, 0.64488f, 0.65423f, 0.66348f, 0.67263f, 0.68167f, 0.69062f, 0.69946f, 0.70819f, 0.71682f,
    0.72534f, 0.73375f, 0.74205f, 0.75023f, 0.75831f, 0.76626f, 0.77411f, 0.78183f, 0.78944f, 0.79693f, 0.80429f,
    0.81154f, 0.81866f, 0.82566f, 0.83254f, 0.83928f, 0.84591f, 0.8524f, 0.85876f, 0.865f, 0.8711f, 0.87708f, 0.88292f,
    0.88862f, 0.89419f, 0.89963f, 0.90493f, 0.9101f, 0.91512f, 0.92001f, 0.92476f, 0.92937f, 0.93384f, 0.93816f,
    0.94235f, 0.94639f, 0.95029f, 0.95405f, 0.95766f, 0.96113f, 0.96445f, 0.96763f, 0.97066f, 0.97354f, 0.97628f,
    0.97887f, 0.98131f, 0.9836f, 0.98574f, 0.98774f, 0.98958f, 0.99128f, 0.99282f, 0.99422f, 0.99546f, 0.99656f,
    0.9975f, 0.99829f, 0.99894f, 0.99943f, 0.99977f, 0.99996f, 1.0f, 0.99988f, 0.99962f, 0.9992f, 0.99863f, 0.99792f,
    0.99705f, 0.99603f, 0.99486f, 0.99354f, 0.99207f, 0.99045f, 0.98868f, 0.98676f, 0.98469f, 0.98247f, 0.9801f,
    0.97759f, 0.97493f, 0.97212f, 0.96916f, 0.96606f, 0.96281f, 0.95941f, 0.95587f, 0.95219f, 0.94836f, 0.94439f,
    0.94028f, 0.93602f, 0.93162f, 0.92708f, 0.9224f, 0.91758f, 0.91263f, 0.90753f, 0.9023f, 0.89693f, 0.89142f,
    0.88579f, 0.88001f, 0.87411f, 0.86807f, 0.8619f, 0.8556f, 0.84917f, 0.84261f, 0.83593f, 0.82911f, 0.82218f,
    0.81512f, 0.80793f, 0.80062f, 0.7932f, 0.78565f, 0.77798f, 0.7702f, 0.7623f, 0.75428f, 0.74615f, 0.73791f, 0.72956f,
    0.72109f, 0.71252f, 0.70384f, 0.69505f, 0.68616f, 0.67716f, 0.66806f, 0.65886f, 0.64956f, 0.64017f, 0.63067f,
    0.62108f, 0.6114f, 0.60162f, 0.59176f, 0.5818f, 0.57176f, 0.56163f, 0.55141f, 0.54111f, 0.53073f, 0.52027f,
    0.50973f, 0.49911f, 0.48842f, 0.47765f, 0.46682f, 0.45591f, 0.44493f, 0.43388f, 0.42277f, 0.4116f, 0.40036f,
    0.38906f, 0.37771f, 0.36629f, 0.35483f, 0.3433f, 0.33173f, 0.32011f, 0.30843f, 0.29671f, 0.28495f, 0.27314f,
    0.26129f, 0.2494f, 0.23748f, 0.22552f, 0.21352f, 0.20149f, 0.18943f, 0.17735f, 0.16523f, 0.15309f, 0.14093f,
    0.12875f, 0.11655f, 0.10432f, 0.092088f, 0.079838f, 0.067576f, 0.055303f, 0.043022f, 0.030735f, 0.018443f,
    0.0061479f, -0.0061479f, -0.018443f, -0.030735f, -0.043022f, -0.055303f, -0.067576f, -0.079838f, -0.092088f,
    -0.10432f, -0.11655f, -0.12875f, -0.14093f, -0.15309f, -0.16523f, -0.17735f, -0.18943f, -0.20149f, -0.21352f,
    -0.22552f, -0.23748f, -0.2494f, -0.26129f, -0.27314f, -0.28495f, -0.29671f, -0.30843f, -0.32011f, -0.33173f,
    -0.3433f, -0.35483f, -0.36629f, -0.37771f, -0.38906f, -0.40036f, -0.4116f, -0.42277f, -0.43388f, -0.44493f,
    -0.45591f, -0.46682f, -0.47765f, -0.48842f, -0.49911f, -0.50973f, -0.52027f, -0.53073f, -0.54111f, -0.55141f,
    -0.56163f, -0.57176f, -0.5818f, -0.59176f, -0.60162f, -0.6114f, -0.62108f, -0.63067f, -0.64017f, -0.64956f,
    -0.65886f, -0.66806f, -0.67716f, -0.68616f, -0.69505f, -0.70384f, -0.71252f, -0.72109f, -0.72956f, -0.73791f,
    -0.74615f, -0.75428f, -0.7623f, -0.7702f, -0.77798f, -0.78565f, -0.7932f, -0.80062f, -0.80793f, -0.81512f,
    -0.82218f, -0.82911f, -0.83593f, -0.84261f, -0.84917f, -0.8556f, -0.8619f, -0.86807f, -0.87411f, -0.88001f,
    -0.88579f, -0.89142f, -0.89693f, -0.9023f, -0.90753f, -0.91263f, -0.91758f, -0.9224f, -0.92708f, -0.93162f,
    -0.93602f, -0.94028f, -0.94439f, -0.94836f, -0.95219f, -0.95587f, -0.95941f, -0.96281f, -0.96606f, -0.96916f,
    -0.97212f, -0.97493f, -0.97759f, -0.9801f, -0.98247f, -0.98469f, -0.98676f, -0.98868f, -0.99045f, -0.99207f,
    -0.99354f, -0.99486f, -0.99603f, -0.99705f, -0.99792f, -0.99863f, -0.9992f, -0.99962f, -0.99988f, -1.0f, -0.99996f,
    -0.99977f, -0.99943f, -0.99894f, -0.99829f, -0.9975f, -0.99656f, -0.99546f, -0.99422f, -0.99282f, -0.99128f,
    -0.98958f, -0.98774f, -0.98574f, -0.9836f, -0.98131f, -0.97887f, -0.97628f, -0.97354f, -0.97066f, -0.96763f,
    -0.96445f, -0.96113f, -0.95766f, -0.95405f, -0.95029f, -0.94639f, -0.94235f, -0.93816f, -0.93384f, -0.92937f,
    -0.92476f, -0.92001f, -0.91512f, -0.9101f, -0.90493f, -0.89963f, -0.89419f, -0.88862f, -0.88292f, -0.87708f,
    -0.8711f, -0.865f, -0.85876f, -0.8524f, -0.84591f, -0.83928f, -0.83254f, -0.82566f, -0.81866f, -0.81154f, -0.80429f,
    -0.79693f, -0.78944f, -0.78183f, -0.77411f, -0.76626f, -0.75831f, -0.75023f, -0.74205f, -0.73375f, -0.72534f,
    -0.71682f, -0.70819f, -0.69946f, -0.69062f, -0.68167f, -0.67263f, -0.66348f, -0.65423f, -0.64488f, -0.63543f,
    -0.62589f, -0.61625f, -0.60652f, -0.5967f, -0.58679f, -0.57679f, -0.5667f, -0.55653f, -0.54627f, -0.53593f,
    -0.52551f, -0.51501f, -0.50443f, -0.49378f, -0.48305f, -0.47224f, -0.46137f, -0.45043f, -0.43941f, -0.42834f,
    -0.41719f, -0.40599f, -0.39472f, -0.38339f, -0.37201f, -0.36057f, -0.34907f, -0.33752f, -0.32592f, -0.31427f,
    -0.30258f, -0.29084f, -0.27905f, -0.26722f, -0.25535f, -0.24345f, -0.2315f, -0.21952f, -0.20751f, -0.19547f,
    -0.18339f, -0.17129f, -0.15917f, -0.14702f, -0.13484f, -0.12265f, -0.11044f, -0.098208f, -0.085965f, -0.073708f,
    -0.061441f, -0.049164f, -0.036879f, -0.024589f, -0.012296f, 0
};


float m_rs;        	//电阻
float m_ls;        	//电感
float m_flux;     	//磁链

//过程噪声协方差矩阵
float Q_0_0;
float Q_0_1;
float Q_0_2;
float Q_0_3;
float Q_1_0;
float Q_1_1;
float Q_1_2;
float Q_1_3;
float Q_2_0;
float Q_2_1;
float Q_2_2;
float Q_2_3;
float Q_3_0;
float Q_3_1;
float Q_3_2;
float Q_3_3;

//测量噪声协方差矩阵
float R_0_0;
float R_0_1;
float R_1_0;
float R_1_1;

//误差协方差矩阵
float P0_0_0;
float P0_0_1;
float P0_0_2;
float P0_0_3;
float P0_1_0;
float P0_1_1;
float P0_1_2;
float P0_1_3;
float P0_2_0;
float P0_2_1;
float P0_2_2;
float P0_2_3;
float P0_3_0;
float P0_3_1;
float P0_3_2;
float P0_3_3;

float Ts; //步长，算法执行周期

//输入矩阵
float B_0_0;
float B_0_1;
float B_1_0;
float B_1_1;
float B_2_0;
float B_2_1;
float B_3_0;
float B_3_1;

//输入变量
float vs_ab_0_0;
float vs_ab_1_0;
float is_ab_0_0;
float is_ab_1_0;

//输出矩阵
float H_0_0;
float H_0_1;
float H_0_2;
float H_0_3;
float H_1_0;
float H_1_1;
float H_1_2;
float H_1_3;

//系统矩阵
float F_0_0;
float F_0_1;
float F_0_2;
float F_0_3;
float F_1_0;
float F_1_1;
float F_1_2;
float F_1_3;
float F_2_0;
float F_2_1;
float F_2_2;
float F_2_3;
float F_3_0;
float F_3_1;
float F_3_2;
float F_3_3;

// 单位阵
float temp_0_0;
float temp_0_1;
float temp_0_2;
float temp_0_3;
float temp_1_0;
float temp_1_1;
float temp_1_2;
float temp_1_3;
float temp_2_0;
float temp_2_1;
float temp_2_2;
float temp_2_3;
float temp_3_0;
float temp_3_1;
float temp_3_2;
float temp_3_3;

float f1_0_0;
float f1_1_0;
float f1_2_0;
float f1_3_0;

float f2_0_0;
float f2_0_1;
float f2_0_2;
float f2_0_3;
float f2_1_0;
float f2_1_1;
float f2_1_2;
float f2_1_3;
float f2_2_0;
float f2_2_1;
float f2_2_2;
float f2_2_3;
float f2_3_0;
float f2_3_1;
float f2_3_2;
float f2_3_3;

float X_pred_0_0;
float X_pred_1_0;
float X_pred_2_0;
float X_pred_3_0;

float Y_pred_0_0;
float Y_pred_1_0;

float Y_0_0;
float Y_1_0;

float P_pred_0_0;
float P_pred_0_1;
float P_pred_0_2;
float P_pred_0_3;    
float P_pred_1_0;
float P_pred_1_1;
float P_pred_1_2;
float P_pred_1_3;  
float P_pred_2_0;
float P_pred_2_1;
float P_pred_2_2;
float P_pred_2_3;
float P_pred_3_0;
float P_pred_3_1;
float P_pred_3_2;
float P_pred_3_3;

float temp_0_0_t;
float temp_0_1_t;
float temp_1_0_t;
float temp_1_1_t;
float temp;

float K_0_0;
float K_0_1;    
float K_1_0;
float K_1_1;   
float K_2_0;
float K_2_1;   
float K_3_0;
float K_3_1;

float tempa_0_0;
float tempa_1_0;
float tempa_2_0;
float tempa_3_0;

/*参数初始化*/
void apt_ekf_init(void)
{
	m_rs 	= MOTOR_PHASE_RES;	//电阻
    m_ls 	= MOTOR_PHASE_LS;	//电感
    m_flux 	= MOTOR_FLUXLINK;	//磁链
	
	/*过程噪声协方差矩阵*/
	Q_0_0 = 0.1f;
	Q_0_1 = 0.0f;
	Q_0_2 = 0.0f;
	Q_0_3 = 0.0f;
	Q_1_0 = 0.0f;
	Q_1_1 = 0.1f;
	Q_1_2 = 0.0f;
	Q_1_3 = 0.0f;
	Q_2_0 = 0.0f;
	Q_2_1 = 0.0f;
	Q_2_2 = 0.08f;
	Q_2_3 = 0.0f;
	Q_3_0 = 0.0f;
	Q_3_1 = 0.0f;
	Q_3_2 = 0.0f;
	Q_3_3 = 0.005f;

	/*测量噪声协方差矩阵*/
	R_0_0 = 0.2f;
	R_0_1 = 0.0f;
	R_1_0 = 0.0f;
	R_1_1 = 0.2f;
	
	Ts = 0.0001f;    // kalman update time ：0.1ms
	
	/*输出矩阵*/
	H_0_0 = 1.0f;
	H_0_1 = 0.0f;
	H_0_2 = 0.0f;
	H_0_3 = 0.0f;
	H_1_0 = 0.0f;
	H_1_1 = 1.0f;
	H_1_2 = 0.0f;
	H_1_3 = 0.0f;

	/*输入矩阵*/
	B_0_0 = 1.0f/m_ls;
	B_0_1 = 0.0f;
	B_1_0 = 0.0f;
	B_1_1 = 1.0f/m_ls;
	B_2_0 = 0.0f;
	B_2_1 = 0.0f;
	B_3_0 = 0.0f;
	B_3_1 = 0.0f;

    /*误差协方差矩阵（估计值与实际值）*/
	P0_0_0 = 0.0f;
	P0_0_1 = 0.0f;
	P0_0_2 = 0.0f;
	P0_0_3 = 0.0f;
	P0_1_0 = 0.0f;
	P0_1_1 = 0.0f;
	P0_1_2 = 0.0f;
	P0_1_3 = 0.0f;
	P0_2_0 = 0.0f;
	P0_2_1 = 0.0f;
	P0_2_2 = 0.0f;
	P0_2_3 = 0.0f;
	P0_3_0 = 0.0f;
	P0_3_1 = 0.0f;
	P0_3_2 = 0.0f;
	P0_3_3 = 0.0f;
	
}

//输入u, 输出xD
_RAM_FUNC void apt_ekf_update(const float *u, float *xd)
{
	vs_ab_0_0 = u[0];   //ualpha
	vs_ab_1_0 = u[1];   //ubeta
	is_ab_0_0 = u[2];   //ialpha
	is_ab_1_0 = u[3];   //ibeta
	m_rs 	  = u[4];   //相电阻
	m_ls 	  = u[5];   //相电感
	m_flux 	  = u[6];   //磁链

    /*线性化后的系统矩阵A，用于公式二*/
	F_0_0 = -m_rs/m_ls;
	F_0_1 = 0.0f;
	F_0_2 = m_flux/m_ls*sinf(xd[3]);
	F_0_3 = m_flux/m_ls*xd[2]*cosf(xd[3]);
	F_1_0 = 0.0f;
	F_1_1 = -m_rs/m_ls;
	F_1_2 = -m_flux/m_ls*cosf(xd[3]);
	F_1_3 = m_flux/m_ls*xd[2]*sinf(xd[3]);
	F_2_0 = 0.0f;
	F_2_1 = 0.0f;
	F_2_2 = 0.0f;
	F_2_3 = 0.0f;
	F_3_0 = 0.0f;
	F_3_1 = 0.0f;
	F_3_2 = 1.0f;
	F_3_3 = 0.0f;
   
    /*单位阵，I阵，临时计算矩阵*/
	temp_0_0 = 1.0f;
	temp_0_1 = 0.0f;
	temp_0_2 = 0.0f;
	temp_0_3 = 0.0f;
	temp_1_0 = 0.0f;
	temp_1_1 = 1.0f;
	temp_1_2 = 0.0f;
	temp_1_3 = 0.0f;
	temp_2_0 = 0.0f;
	temp_2_1 = 0.0f;
	temp_2_2 = 1.0f;
	temp_2_3 = 0.0f;
	temp_3_0 = 0.0f;
	temp_3_1 = 0.0f;
	temp_3_2 = 0.0f;
	temp_3_3 = 1.0f;

	/*GX，非线性方程*/
	f1_0_0 = -m_rs/m_ls*xd[0]+m_flux/m_ls*xd[2]*sinf(xd[3]);
	f1_1_0 = -m_rs/m_ls*xd[1]-m_flux/m_ls*xd[2]*cosf(xd[3]);
	f1_2_0 = 0.0f;
	f1_3_0 = xd[2];
    
	/*线性离散化后的系统阵，f = I + Ts*A，用于公式二*/
	f2_0_0 = temp_0_0 + (Ts*F_0_0);
	f2_0_1 = temp_0_1 + (Ts*F_0_1);
	f2_0_2 = temp_0_2 + (Ts*F_0_2);
	f2_0_3 = temp_0_3 + (Ts*F_0_3);
	f2_1_0 = temp_1_0 + (Ts*F_1_0);
	f2_1_1 = temp_1_1 + (Ts*F_1_1);
	f2_1_2 = temp_1_2 + (Ts*F_1_2);
	f2_1_3 = temp_1_3 + (Ts*F_1_3);
	f2_2_0 = temp_2_0 + (Ts*F_2_0);
	f2_2_1 = temp_2_1 + (Ts*F_2_1);
	f2_2_2 = temp_2_2 + (Ts*F_2_2);
	f2_2_3 = temp_2_3 + (Ts*F_2_3);
	f2_3_0 = temp_3_0 + (Ts*F_3_0);
	f2_3_1 = temp_3_1 + (Ts*F_3_1);
	f2_3_2 = temp_3_2 + (Ts*F_3_2);
	f2_3_3 = temp_3_3 + (Ts*F_3_3);

  //kalman公式一， 预测方程（先验估计）：X(k|k-1)的估计 = X(k-1|k-1)的估计 + Ts*[Gx + B*U]
	X_pred_0_0 = xd[0] + Ts*(f1_0_0 + B_0_0*vs_ab_0_0 + B_0_1*vs_ab_1_0);    //iα 的估计，状态空间表达式
	X_pred_1_0 = xd[1] + Ts*(f1_1_0 + B_1_0*vs_ab_0_0 + B_1_1*vs_ab_1_0);    //iβ 的估计
	X_pred_2_0 = xd[2] + Ts*(f1_2_0 + B_2_0*vs_ab_0_0 + B_2_1*vs_ab_1_0);    //Ω 的估计
	X_pred_3_0 = xd[3] + Ts*(f1_3_0 + B_3_0*vs_ab_0_0 + B_3_1*vs_ab_1_0);     //θ 的估计
	
	//输出方程估计，估计值，用于公式4
	Y_pred_0_0 = H_0_0*X_pred_0_0 + H_0_1*X_pred_1_0 + H_0_2*X_pred_2_0 + H_0_3*X_pred_3_0;  //iα 的估计，输出方程
	Y_pred_1_0 = H_1_0*X_pred_0_0 + H_1_1*X_pred_1_0 + H_1_2*X_pred_2_0 + H_1_3*X_pred_3_0;  //iβ 的估计


	Y_0_0 = is_ab_0_0;  //iα 的测量，Clark变换的输出
	Y_1_0 = is_ab_1_0;  //iβ 的测量

    /*kalman公式二，先验误差协方差  ：P(k|k-1) = f系统矩阵*P(k-1|k-1)*f的转置 + Q矩阵，(f = I + Ts*F(k|k-1))*/
	//f*P   4*4矩阵
	P_pred_0_0 = f2_0_0*P0_0_0 + f2_0_1*P0_1_0 + f2_0_2*P0_2_0 + f2_0_3*P0_3_0;    //f阵第一行
	P_pred_0_1 = f2_0_0*P0_0_1 + f2_0_1*P0_1_1 + f2_0_2*P0_2_1 + f2_0_3*P0_3_1;
	P_pred_0_2 = f2_0_0*P0_0_2 + f2_0_1*P0_1_2 + f2_0_2*P0_2_2 + f2_0_3*P0_3_2;
	P_pred_0_3 = f2_0_0*P0_0_3 + f2_0_1*P0_1_3 + f2_0_2*P0_2_3 + f2_0_3*P0_3_3;    
	P_pred_1_0 = f2_1_0*P0_0_0 + f2_1_1*P0_1_0 + f2_1_2*P0_2_0 + f2_1_3*P0_3_0;     //f阵第二行
	P_pred_1_1 = f2_1_0*P0_0_1 + f2_1_1*P0_1_1 + f2_1_2*P0_2_1 + f2_1_3*P0_3_1;
	P_pred_1_2 = f2_1_0*P0_0_2 + f2_1_1*P0_1_2 + f2_1_2*P0_2_2 + f2_1_3*P0_3_2;
	P_pred_1_3 = f2_1_0*P0_0_3 + f2_1_1*P0_1_3 + f2_1_2*P0_2_3 + f2_1_3*P0_3_3;  
	P_pred_2_0 = f2_2_0*P0_0_0 + f2_2_1*P0_1_0 + f2_2_2*P0_2_0 + f2_2_3*P0_3_0;     //f阵第三行
	P_pred_2_1 = f2_2_0*P0_0_1 + f2_2_1*P0_1_1 + f2_2_2*P0_2_1 + f2_2_3*P0_3_1;
	P_pred_2_2 = f2_2_0*P0_0_2 + f2_2_1*P0_1_2 + f2_2_2*P0_2_2 + f2_2_3*P0_3_2;
	P_pred_2_3 = f2_2_0*P0_0_3 + f2_2_1*P0_1_3 + f2_2_2*P0_2_3 + f2_2_3*P0_3_3;
	P_pred_3_0 = f2_3_0*P0_0_0 + f2_3_1*P0_1_0 + f2_3_2*P0_2_0 + f2_3_3*P0_3_0;     //f阵第四行
	P_pred_3_1 = f2_3_0*P0_0_1 + f2_3_1*P0_1_1 + f2_3_2*P0_2_1 + f2_3_3*P0_3_1;
	P_pred_3_2 = f2_3_0*P0_0_2 + f2_3_1*P0_1_2 + f2_3_2*P0_2_2 + f2_3_3*P0_3_2;
	P_pred_3_3 = f2_3_0*P0_0_3 + f2_3_1*P0_1_3 + f2_3_2*P0_2_3 + f2_3_3*P0_3_3;
    //(f*P)*f的转置 + Q     4*4矩阵
	P_pred_0_0 = P_pred_0_0*f2_0_0 + P_pred_0_1*f2_0_1 + P_pred_0_2*f2_0_2 + P_pred_0_3*f2_0_3 + Q_0_0;
	P_pred_0_1 = P_pred_0_0*f2_1_0 + P_pred_0_1*f2_1_1 + P_pred_0_2*f2_1_2 + P_pred_0_3*f2_1_3 + Q_0_1;
	P_pred_0_2 = P_pred_0_0*f2_2_0 + P_pred_0_1*f2_2_1 + P_pred_0_2*f2_2_2 + P_pred_0_3*f2_2_3 + Q_0_2;
	P_pred_0_3 = P_pred_0_0*f2_3_0 + P_pred_0_1*f2_3_1 + P_pred_0_2*f2_3_2 + P_pred_0_3*f2_3_3 + Q_0_3;    
	P_pred_1_0 = P_pred_1_0*f2_0_0 + P_pred_1_1*f2_0_1 + P_pred_1_2*f2_0_2 + P_pred_1_3*f2_0_3 + Q_1_0;
	P_pred_1_1 = P_pred_1_0*f2_1_0 + P_pred_1_1*f2_1_1 + P_pred_1_2*f2_1_2 + P_pred_1_3*f2_1_3 + Q_1_1;
	P_pred_1_2 = P_pred_1_0*f2_2_0 + P_pred_1_1*f2_2_1 + P_pred_1_2*f2_2_2 + P_pred_1_3*f2_2_3 + Q_1_2;
	P_pred_1_3 = P_pred_1_0*f2_3_0 + P_pred_1_1*f2_3_1 + P_pred_1_2*f2_3_2 + P_pred_1_3*f2_3_3 + Q_1_3;    
	P_pred_2_0 = P_pred_2_0*f2_0_0 + P_pred_2_1*f2_0_1 + P_pred_2_2*f2_0_2 + P_pred_2_3*f2_0_3 + Q_2_0;
	P_pred_2_1 = P_pred_2_0*f2_1_0 + P_pred_2_1*f2_1_1 + P_pred_2_2*f2_1_2 + P_pred_2_3*f2_1_3 + Q_2_1;
	P_pred_2_2 = P_pred_2_0*f2_2_0 + P_pred_2_1*f2_2_1 + P_pred_2_2*f2_2_2 + P_pred_2_3*f2_2_3 + Q_2_2;
	P_pred_2_3 = P_pred_2_0*f2_3_0 + P_pred_2_1*f2_3_1 + P_pred_2_2*f2_3_2 + P_pred_2_3*f2_3_3 + Q_2_3; 
	P_pred_3_0 = P_pred_3_0*f2_0_0 + P_pred_3_1*f2_0_1 + P_pred_3_2*f2_0_2 + P_pred_3_3*f2_0_3 + Q_3_0;
	P_pred_3_1 = P_pred_3_0*f2_1_0 + P_pred_3_1*f2_1_1 + P_pred_3_2*f2_1_2 + P_pred_3_3*f2_1_3 + Q_3_1;
	P_pred_3_2 = P_pred_3_0*f2_2_0 + P_pred_3_1*f2_2_1 + P_pred_3_2*f2_2_2 + P_pred_3_3*f2_2_3 + Q_3_2;
	P_pred_3_3 = P_pred_3_0*f2_3_0 + P_pred_3_1*f2_3_1 + P_pred_3_2*f2_3_2 + P_pred_3_3*f2_3_3 + Q_3_3;

    /*kalman公式三，卡尔曼增益：K(k|k-1) = P(k|k-1)*H的转置/(H*P(k|k-1)*H的转置) + R)*/
	//H*P(k|k-1)   (2,4)*(4,4)  = (2,4)
	temp_0_0 = H_0_0*P_pred_0_0 + H_0_1*P_pred_1_0 + H_0_2*P_pred_2_0 + H_0_3*P_pred_3_0;
	temp_0_1 = H_0_0*P_pred_0_1 + H_0_1*P_pred_1_1 + H_0_2*P_pred_2_1 + H_0_3*P_pred_3_1;
	temp_0_2 = H_0_0*P_pred_0_2 + H_0_1*P_pred_1_2 + H_0_2*P_pred_2_2 + H_0_3*P_pred_3_2;
	temp_0_3 = H_0_0*P_pred_0_3 + H_0_1*P_pred_1_3 + H_0_2*P_pred_2_3 + H_0_3*P_pred_3_3;   
	temp_1_0 = H_1_0*P_pred_0_0 + H_1_1*P_pred_1_0 + H_1_2*P_pred_2_0 + H_1_3*P_pred_3_0;
	temp_1_1 = H_1_0*P_pred_0_1 + H_1_1*P_pred_1_1 + H_1_2*P_pred_2_1 + H_1_3*P_pred_3_1;
	temp_1_2 = H_1_0*P_pred_0_2 + H_1_1*P_pred_1_2 + H_1_2*P_pred_2_2 + H_1_3*P_pred_3_2;
	temp_1_3 = H_1_0*P_pred_0_3 + H_1_1*P_pred_1_3 + H_1_2*P_pred_2_3 + H_1_3*P_pred_3_3;
    //(H*P(k|k-1))*H的转置 + R  ,  (2,4)*(4,2) = (2,2)
	temp_0_0 = temp_0_0*H_0_0 + temp_0_1*H_0_1 + temp_0_2*H_0_2 + temp_0_3*H_0_3 + R_0_0;
	temp_0_1 = temp_0_0*H_1_0 + temp_0_1*H_1_1 + temp_0_2*H_1_2 + temp_0_3*H_1_3 + R_0_1;    
	temp_1_0 = temp_1_0*H_0_0 + temp_1_1*H_0_1 + temp_1_2*H_0_2 + temp_1_3*H_0_3 + R_1_0;
	temp_1_1 = temp_1_0*H_1_0 + temp_1_1*H_1_1 + temp_1_2*H_1_2 + temp_1_3*H_1_3 + R_1_1;

    //(2,2)矩阵求逆
	temp_0_0_t = temp_0_0;   //暂存估计误差，用作伴随阵
	temp_0_1_t = temp_0_1;
	temp_1_0_t = temp_1_0;
	temp_1_1_t = temp_1_1;

	temp = temp_0_0*temp_1_1 - temp_0_1*temp_1_0; //行列式
	if(temp != 0)     //行列式为分母，不能为0
	{
		//A的逆 = A的伴随/A的行列式
	   temp_0_0 = temp_1_1_t/temp;     //主对调，次反号
	   temp_0_1 = -temp_0_1_t/temp;
	   temp_1_0 = -temp_1_0_t/temp;
	   temp_1_1 = temp_0_0_t/temp;
	}
    // P(k|k-1)*H的转置，(4,4)*(4*2) = (4,2)
	K_0_0 = P_pred_0_0*H_0_0 + P_pred_0_1*H_0_1 + P_pred_0_2*H_0_2 + P_pred_0_3*H_0_3;
	K_0_1 = P_pred_0_0*H_1_0 + P_pred_0_1*H_1_1 + P_pred_0_2*H_1_2 + P_pred_0_3*H_1_3;    
	K_1_0 = P_pred_1_0*H_0_0 + P_pred_1_1*H_0_1 + P_pred_1_2*H_0_2 + P_pred_1_3*H_0_3;
	K_1_1 = P_pred_1_0*H_1_0 + P_pred_1_1*H_1_1 + P_pred_1_2*H_1_2 + P_pred_1_3*H_1_3;   
	K_2_0 = P_pred_2_0*H_0_0 + P_pred_2_1*H_0_1 + P_pred_2_2*H_0_2 + P_pred_2_3*H_0_3;
	K_2_1 = P_pred_2_0*H_1_0 + P_pred_2_1*H_1_1 + P_pred_2_2*H_1_2 + P_pred_2_3*H_1_3;   
	K_3_0 = P_pred_3_0*H_0_0 + P_pred_3_1*H_0_1 + P_pred_3_2*H_0_2 + P_pred_3_3*H_0_3;
	K_3_1 = P_pred_3_0*H_1_0 + P_pred_3_1*H_1_1 + P_pred_3_2*H_1_2 + P_pred_3_3*H_1_3;
	//P(k|k-1)*H的转置 * 逆阵 ， (4,2)*(2,2) = (4,2)
	K_0_0 = K_0_0*temp_0_0 + K_0_1*temp_1_0;  //卡尔曼增益
	K_0_1 = K_0_0*temp_0_1 + K_0_1*temp_1_1;  
	K_1_0 = K_1_0*temp_0_0 + K_1_1*temp_1_0;
	K_1_1 = K_1_0*temp_0_1 + K_1_1*temp_1_1;    
	K_2_0 = K_2_0*temp_0_0 + K_2_1*temp_1_0;
	K_2_1 = K_2_0*temp_0_1 + K_2_1*temp_1_1;   
	K_3_0 = K_3_0*temp_0_0 + K_3_1*temp_1_0;
	K_3_1 = K_3_0*temp_0_1 + K_3_1*temp_1_1;

    /*kalman公式四，修正估计值（后验估计）：X(k|k)的估计 = X(k|k-1)的估计 + K(k|k-1)增益*(量测的Y(k) - 估计的Y(k|k-1))*/
	//(4,2)*(2,1) = (4,1), 后验估计值
	tempa_0_0 = X_pred_0_0 + K_0_0*(Y_0_0 - Y_pred_0_0) + K_0_1*(Y_1_0 - Y_pred_1_0);  //ialpha
	tempa_1_0 = X_pred_1_0 + K_1_0*(Y_0_0 - Y_pred_0_0) + K_1_1*(Y_1_0 - Y_pred_1_0);   //ibeta
	tempa_2_0 = X_pred_2_0 + K_2_0*(Y_0_0 - Y_pred_0_0) + K_2_1*(Y_1_0 - Y_pred_1_0);  //omiga
	tempa_3_0 = X_pred_3_0 + K_3_0*(Y_0_0 - Y_pred_0_0) + K_3_1*(Y_1_0 - Y_pred_1_0);   //theta

	/*kalman公式五，更新误差协方差 ：P(k|k)  = (I - K(k|k-1)*H)*P(k|k-1) =  P(k|k-1) - K(k|k-1)*H*P(k|k-1)*/
	//K(k|k-1)*H ,(4,2)*(2,4) = (4,4)
	temp_0_0 = K_0_0*H_0_0 + K_0_1*H_1_0;
	temp_0_1 = K_0_0*H_0_1 + K_0_1*H_1_1;
	temp_0_2 = K_0_0*H_0_2 + K_0_1*H_1_2;
	temp_0_3 = K_0_0*H_0_3 + K_0_1*H_1_3;    
	temp_1_0 = K_1_0*H_0_0 + K_1_1*H_1_0;
	temp_1_1 = K_1_0*H_0_1 + K_1_1*H_1_1;
	temp_1_2 = K_1_0*H_0_2 + K_1_1*H_1_2;
	temp_1_3 = K_1_0*H_0_3 + K_1_1*H_1_3;    
	temp_2_0 = K_2_0*H_0_0 + K_2_1*H_1_0;
	temp_2_1 = K_2_0*H_0_1 + K_2_1*H_1_1;
	temp_2_2 = K_2_0*H_0_2 + K_2_1*H_1_2;
	temp_2_3 = K_2_0*H_0_3 + K_2_1*H_1_3;   
	temp_3_0 = K_3_0*H_0_0 + K_3_1*H_1_0;
	temp_3_1 = K_3_0*H_0_1 + K_3_1*H_1_1;
	temp_3_2 = K_3_0*H_0_2 + K_3_1*H_1_2;
	temp_3_3 = K_3_0*H_0_3 + K_3_1*H_1_3;
    //(4,4)*(4,4) = (4,4)
	P0_0_0 =   P_pred_0_0 - (temp_0_0*P_pred_0_0 + temp_0_1*P_pred_1_0 + temp_0_2*P_pred_2_0 + temp_0_3*P_pred_3_0);
	P0_0_1 =   P_pred_0_1 - (temp_0_0*P_pred_0_1 + temp_0_1*P_pred_1_1 + temp_0_2*P_pred_2_1 + temp_0_3*P_pred_3_1);
	P0_0_2 =   P_pred_0_2 - (temp_0_0*P_pred_0_2 + temp_0_1*P_pred_1_2 + temp_0_2*P_pred_2_2 + temp_0_3*P_pred_3_2);
	P0_0_3 =   P_pred_0_3 - (temp_0_0*P_pred_0_3 + temp_0_1*P_pred_1_3 + temp_0_2*P_pred_2_3 + temp_0_3*P_pred_3_3);  
	P0_1_0 =   P_pred_1_0 - (temp_1_0*P_pred_0_0 + temp_1_1*P_pred_1_0 + temp_1_2*P_pred_2_0 + temp_1_3*P_pred_3_0);
	P0_1_1 =   P_pred_1_1 - (temp_1_0*P_pred_0_1 + temp_1_1*P_pred_1_1 + temp_1_2*P_pred_2_1 + temp_1_3*P_pred_3_1);
	P0_1_2 =   P_pred_1_2 - (temp_1_0*P_pred_0_2 + temp_1_1*P_pred_1_2 + temp_1_2*P_pred_2_2 + temp_1_3*P_pred_3_2);
	P0_1_3 =   P_pred_1_3 - (temp_1_0*P_pred_0_3 + temp_1_1*P_pred_1_3 + temp_1_2*P_pred_2_3 + temp_1_3*P_pred_3_3);    
	P0_2_0 =   P_pred_2_0 - (temp_2_0*P_pred_0_0 + temp_2_1*P_pred_1_0 + temp_2_2*P_pred_2_0 + temp_2_3*P_pred_3_0);
	P0_2_1 =   P_pred_2_1 - (temp_2_0*P_pred_0_1 + temp_2_1*P_pred_1_1 + temp_2_2*P_pred_2_1 + temp_2_3*P_pred_3_1);
	P0_2_2 =   P_pred_2_2 - (temp_2_0*P_pred_0_2 + temp_2_1*P_pred_1_2 + temp_2_2*P_pred_2_2 + temp_2_3*P_pred_3_2);
	P0_2_3 =   P_pred_2_3 - (temp_2_0*P_pred_0_3 + temp_2_1*P_pred_1_3 + temp_2_2*P_pred_2_3 + temp_2_3*P_pred_3_3);  
	P0_3_0 =   P_pred_3_0 - (temp_3_0*P_pred_0_0 + temp_3_1*P_pred_1_0 + temp_3_2*P_pred_2_0 + temp_3_3*P_pred_3_0);
	P0_3_1 =   P_pred_3_1 - (temp_3_0*P_pred_0_1 + temp_3_1*P_pred_1_1 + temp_3_2*P_pred_2_1 + temp_3_3*P_pred_3_1);
	P0_3_2 =   P_pred_3_2 - (temp_3_0*P_pred_0_2 + temp_3_1*P_pred_1_2 + temp_3_2*P_pred_2_2 + temp_3_3*P_pred_3_2);
	P0_3_3 =   P_pred_3_3 - (temp_3_0*P_pred_0_3 + temp_3_1*P_pred_1_3 + temp_3_2*P_pred_2_3 + temp_3_3*P_pred_3_3);

    //输出角度限幅，2Π
	if(tempa_3_0 > DOUBLE_PI)   
	{
		tempa_3_0 -= DOUBLE_PI;  
	}
	xd[0] = tempa_0_0;   //ialpha
	xd[1] = tempa_1_0;   //ibeta
	xd[2] = tempa_2_0;   //omiga
	xd[3] = tempa_3_0;   //theta
}
